/*
Что нужно сделать

Реализуйте программу чтения информации из ведомости по учёту выплат.
 Сама ведомость представляет собой следующую таблицу:

    имя и фамилия человека;
    количество денег, которые были выплачены лицу;
    дата выплаты в формате ДД.ММ.ГГГГ.

На основе данных из ведомости следует подсчитать общее количество выплаченных средств и
 определить человека с максимальной суммой выплат.
*/
#include <iostream>
#include <vector>
#include <string>

int main() {
    std::vector<string> name[2]
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
